joeferner/stm32-wifi-door-bell/firmware/stm32lib/cc3000.c

#include "cc3000.h"
#include <stm32f10x_gpio.h>
#include <stm32f10x_exti.h>
#include <stdio.h>
#include <string.h>
#include "cc3000-host-driver/wlan.h"
#include "cc3000-host-driver/hci.h"
#include "cc3000-host-driver/netapp.h"
#include "cc3000-host-driver/cc3000_common.h"
#include "cc3000-host-driver/socket.h"
#include "cc3000-host-driver/nvmem.h"
#include "util.h"
#include "spi.h"
#include "delay.h"

#ifdef CC3000_ENABLE

#define MAXSSID           (32)
#define MAXLENGTHKEY      (32)  /* Cleared for 32 bytes by TI engineering 29/08/13 */

// The magic number that resides at the end of the TX/RX buffer (1 byte after the allocated size)
// for the purpose of detection of the overrun. The location of the memory where the magic number
// resides shall never be written. In case it is written - the overrun occured and either recevie function
// or send function will stuck forever.
#define CC3000_BUFFER_MAGIC_NUMBER (0xDE)

#define CC3000_SPI_STATE_POWERUP              (0)
#define CC3000_SPI_STATE_INITIALIZED          (1)
#define CC3000_SPI_STATE_IDLE                 (2)
#define CC3000_SPI_STATE_WRITE_IRQ            (3)
#define CC3000_SPI_STATE_WRITE_FIRST_PORTION  (4)
#define CC3000_SPI_STATE_WRITE_EOT            (5)
#define CC3000_SPI_STATE_READ_IRQ             (6)
#define CC3000_SPI_STATE_READ_FIRST_PORTION   (7)
#define CC3000_SPI_STATE_READ_EOT             (8)

#define CC3000_HEADERS_SIZE_EVNT              (SPI_HEADER_SIZE + 5)
#define CC3000_SPI_HEADER_SIZE                (5)

#define CC3000_READ                            (3)
#define CC3000_WRITE                           (1)
#define CC3000_HI(value)                       (((value) & 0xFF00) >> 8)
#define CC3000_LO(value)                       ((value) & 0x00FF)

#define CC3000_SUCCESS 0

typedef struct {
  BOOL isSmartConfigFinished: 1;
  BOOL isConnected: 1;
  BOOL hasDHCP: 1;
  BOOL okToShutdown: 1;
} _CC3000Status;

typedef struct {
  _cc3000_spiHandleRx spiRxHandler;
  uint16_t txPacketLength;
  uint16_t rxPacketLength;
  uint16_t spiState;
  uint8_t* txPacket;
  uint8_t* rxPacket;
} _CC3000SpiInformation;

typedef struct {
  BOOL closed;
  uint8_t rxBuffer[CC3000_RX_BUFFER_SIZE];
  uint8_t rxBufferIndex;
  int16_t bufferSize;
} _CC3000Socket;

_CC3000Status _cc3000_status;
_CC3000SpiInformation _cc3000_spiInformation;
_CC3000Socket _cc3000_sockets[MAX_SOCKETS];
uint8_t _cc3000_pingReportNum;
netapp_pingreport_args_t _cc3000_pingReport;
BOOL _cc3000_irqEnabled;
BOOL _cc3000_inIrq;
uint8_t spi_buffer[CC3000_RX_BUFFER_SIZE];

// used by wlan.c
uint8_t wlan_tx_buffer[CC3000_TX_BUFFER_SIZE];

void _cc3000_cs_assert();
void _cc3000_cs_deassert();
void _cc3000_en_assert();
void _cc3000_en_deassert();
void _cc3000_asyncCallback(long lEventType, char* data, unsigned char length);
char* _cc3000_sendFWPatches(unsigned long* length);
char* _cc3000_sendDriverPatches(unsigned long* length);
char* _cc3000_sendBootLoaderPatches(unsigned long* length);
long _cc3000_readWlanInterruptPin();
void _cc3000_wlanInterruptEnable();
void _cc3000_wlanInterruptDisable();
void _cc3000_writeWlanPin(unsigned char val);
uint8_t _cc3000_spiTransfer(uint8_t d);
void _cc3000_spiReadHeader();
void _cc3000_spiReadDataSynchronous(uint8_t* data, uint16_t size);
void _cc3000_spiWriteDataSynchronous(uint8_t* data, uint16_t size);
void _cc3000_ssiContReadOperation();
BOOL _cc3000_spiReadDataCont();
void _cc3000_spiTriggerRxProcessing();
void _cc3000_spiFirstWrite(uint8_t* buffer, uint16_t length);
BOOL _cc3000_scanSSIDs(uint32_t time);
BOOL _cc3000_connectOpen(const char* ssid);
BOOL _cc3000_connectSecure(const char* ssid, const char* key, int32_t secMode);
BOOL _cc3000_getFirmwareVersion(uint8_t* major, uint8_t* minor);

void cc3000_setupGpio() {
  GPIO_InitTypeDef gpioInitStructure;

  printf("BEGIN CC3000 Setup GPIO\n");

  if (CC3000_RCC1) {
    RCC_APB1PeriphClockCmd(CC3000_RCC1, ENABLE);
  }
  if (CC3000_RCC2) {
    RCC_APB2PeriphClockCmd(CC3000_RCC2, ENABLE);
  }

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

  gpioInitStructure.GPIO_Pin = CC3000_CS_PIN;
  gpioInitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  gpioInitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(CC3000_CS, &gpioInitStructure);

  gpioInitStructure.GPIO_Pin = CC3000_IRQ_PIN;
  gpioInitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  gpioInitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(CC3000_IRQ, &gpioInitStructure);

  gpioInitStructure.GPIO_Pin = CC3000_EN_PIN;
  gpioInitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  gpioInitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(CC3000_EN, &gpioInitStructure);

  _cc3000_cs_deassert();
  _cc3000_en_deassert();

  printf("END CC3000 Setup GPIO\n");
}

BOOL cc3000_setup(uint8_t patchReq, BOOL useSmartConfigData, const char* deviceName) {
  printf("BEGIN CC3000 Setup (patchReq: %d, useSmartConfigData: %s, deviceName: %s)\n", patchReq, useSmartConfigData ? "TRUE" : "FALSE", deviceName);

  _cc3000_pingReportNum = 0;
  _cc3000_irqEnabled = FALSE;
  memset(&_cc3000_status, 0, sizeof(_cc3000_status));
  memset(&_cc3000_pingReport, 0, sizeof(_cc3000_pingReport));
  for (int i = 0; i < MAX_SOCKETS; i++) {
    _cc3000_sockets[i].closed = FALSE;
  }
  _cc3000_inIrq = FALSE;

  wlan_init(
    _cc3000_asyncCallback,
    _cc3000_sendFWPatches,
    _cc3000_sendDriverPatches,
    _cc3000_sendBootLoaderPatches,
    _cc3000_readWlanInterruptPin,
    _cc3000_wlanInterruptEnable,
    _cc3000_wlanInterruptDisable,
    _cc3000_writeWlanPin
  );

  wlan_start(patchReq);

  uint8_t firmwareMajor, firmwareMinor;
  if (_cc3000_getFirmwareVersion(&firmwareMajor, &firmwareMinor)) {
    printf("CC3000 firmware: %d.%d\n", firmwareMajor, firmwareMinor);
  } else {
    printf("failed to get firmware\n");
    return FALSE;
  }

  // Check if we should erase previous stored connection details
  // (most likely written with data from the SmartConfig app)
  if (!useSmartConfigData) {
    // Manual connection only (no auto, profiles, etc.)
    wlan_ioctl_set_connection_policy(0, 0, 0);
    // Delete previous profiles from memory
    wlan_ioctl_del_profile(255);
  } else {
    // Auto Connect - the C3000 device tries to connect to any AP it detects during scanning:
    // wlan_ioctl_set_connection_policy(1, 0, 0)

