joeferner/stm32-wifi-door-bell/firmware/stm32lib/cc3000.c
    // Fast Connect - the CC3000 device tries to reconnect to the last AP connected to:
    // wlan_ioctl_set_connection_policy(0, 1, 0)

    // Use Profiles - the CC3000 device tries to connect to an AP from profiles:
    wlan_ioctl_set_connection_policy(0, 0, 1);
  }

  if (wlan_set_event_mask(HCI_EVNT_WLAN_UNSOL_INIT        |
                          //HCI_EVNT_WLAN_ASYNC_PING_REPORT |// we want ping reports
                          //HCI_EVNT_BSD_TCP_CLOSE_WAIT |
                          //HCI_EVNT_WLAN_TX_COMPLETE |
                          HCI_EVNT_WLAN_KEEPALIVE) != CC3000_SUCCESS) {
    printf("WLAN Set Event Mask FAIL\n");
    return FALSE;
  }

  // Wait for re-connection if we're using SmartConfig data
  if (useSmartConfigData) {
    // Wait for a connection
    uint32_t timeout = 0;
    while (!_cc3000_status.isConnected) {
      _cc3000_irqPoll();
      if (timeout > WLAN_CONNECT_TIMEOUT) {
        return FALSE;
      }
      timeout += 10;
      delay_ms(10);
    }

    delay_ms(1000);
    if (_cc3000_status.hasDHCP) {
      mdnsAdvertiser(1, (char*) deviceName, strlen(deviceName));
    }
  }

  printf("END CC3000 Setup\n");
  return TRUE;
}

SOCKET cc3000_connectUDP(uint32_t destIP, uint16_t destPort) {
  sockaddr socketAddress;
  SOCKET sock;

  sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
  if (-1 == sock) {
    return -1;
  }

  memset(&socketAddress, 0x00, sizeof(socketAddress));
  socketAddress.sa_family = AF_INET;
  socketAddress.sa_data[0] = (destPort & 0xFF00) >> 8;  // Set the Port Number
  socketAddress.sa_data[1] = (destPort & 0x00FF);
  socketAddress.sa_data[2] = destIP >> 24;
  socketAddress.sa_data[3] = destIP >> 16;
  socketAddress.sa_data[4] = destIP >> 8;
  socketAddress.sa_data[5] = destIP;

  if (-1 == connect(sock, &socketAddress, sizeof(socketAddress))) {
    closesocket(sock);
    return -1;
  }

  return sock;
}

BOOL cc3000_socket_connected(SOCKET sock) {
  if (sock < 0) {
    return FALSE;
  }

  if (!cc3000_socket_available(sock) && _cc3000_sockets[sock].closed == TRUE) {
    //if (CC3KPrinter != 0) CC3KPrinter->println("No more data, and closed!");
    closesocket(sock);
    _cc3000_sockets[sock].closed = FALSE;
    sock = -1;
    return FALSE;
  }

  return TRUE;
}

int cc3000_socket_available(SOCKET sockIndex) {
  // not open!
  if (sockIndex < 0) {
    return 0;
  }

  _CC3000Socket* sock = &_cc3000_sockets[sockIndex];

  if ((sock->bufferSize > 0) // we have some data in the internal buffer
      && (sock->rxBufferIndex < sock->bufferSize)) {  // we havent already spit it all out
    return (sock->bufferSize - sock->rxBufferIndex);
  }

  // do a select() call on this socket
  timeval timeout;
  fd_set fd_read;

  memset(&fd_read, 0, sizeof(fd_read));
  FD_SET(sockIndex, &fd_read);

  timeout.tv_sec = 0;
  timeout.tv_usec = 5000; // 5 millisec

  int16_t s = select(sockIndex + 1, &fd_read, NULL, NULL, &timeout);
  if (s == 1) {
    return 1; // some data is available to read
  }
  return 0; // no data is available
}

int cc3000_socket_write(SOCKET sock, const void* buf, uint16_t len, uint32_t flags) {
  return send(sock, buf, len, flags);
}

int cc3000_socket_read(SOCKET sock, void* buf, uint16_t len, uint32_t flags) {
  return recv(sock, buf, len, flags);
}

BOOL cc3000_socket_close(SOCKET sock) {
  return closesocket(sock);
}


void _cc3000_cs_assert() {
  GPIO_ResetBits(CC3000_CS, CC3000_CS_PIN);
}

void _cc3000_cs_deassert() {
  GPIO_SetBits(CC3000_CS, CC3000_CS_PIN);
}

void _cc3000_en_assert() {
  GPIO_SetBits(CC3000_EN, CC3000_EN_PIN);
}

void _cc3000_en_deassert() {
  GPIO_ResetBits(CC3000_EN, CC3000_EN_PIN);
}

extern void SpiReceiveHandler(void* pvBuffer);

BOOL _cc3000_getFirmwareVersion(uint8_t* major, uint8_t* minor) {
  uint8_t fwpReturn[2];

  if (nvmem_read_sp_version(fwpReturn) != CC3000_SUCCESS) {
    printf("Unable to read the firmware version\n");
    return FALSE;
  }

  *major = fwpReturn[0];
  *minor = fwpReturn[1];

  return TRUE;
}

BOOL cc3000_connectToAP(const char* ssid, const char* key, uint8_t secmode) {
  int16_t timer;

  do {
    _cc3000_irqPoll();

    /* MEME: not sure why this is absolutely required but the cc3k freaks
       if you dont. maybe bootup delay? */
    // Setup a 4 second SSID scan
    _cc3000_scanSSIDs(4000);
    // Wait for results
    delay_ms(4500);
    _cc3000_scanSSIDs(0);

    /* Attempt to connect to an access point */
    printf("Connecting to '%s' (key: '%s', security: '%d')\n", ssid, key, secmode);
    if ((secmode == 0) || (strlen(key) == 0)) {
      /* Connect to an unsecured network */
      if (!_cc3000_connectOpen(ssid)) {
        printf("Failed to connect\n");
        continue;
      }
    } else {
      /* Connect to a secure network using WPA2, etc */
      if (!_cc3000_connectSecure(ssid, key, secmode)) {
        printf("Failed to connect\n");
        continue;
      }
    }

    timer = WLAN_CONNECT_TIMEOUT;

    /* Wait around a bit for the async connected signal to arrive or timeout */
    printf("Waiting to connect...\n");
    while ((timer > 0) && !_cc3000_status.isConnected) {
      _cc3000_irqPoll();
      delay_ms(10);
      timer -= 10;
    }
    if (timer <= 0) {
      printf("Timed out!\n");
    }
  } while (!_cc3000_status.isConnected);

  return TRUE;
}

BOOL cc3000_checkDHCP() {
  // Ugly hack to fix UDP issues with the 1.13 firmware by calling
  // gethostbyname on localhost.  The output is completely ignored
  // but for some reason this call is necessary or else UDP won't
  // work.  See this thread from TI for more details and the genesis
  // of the workaround: http://e2e.ti.com/support/wireless_connectivity/f/851/t/342177.aspx
  // Putting this in checkDHCP is a nice way to make it just work
  // for people without any need to add to their sketch.
  if (_cc3000_status.hasDHCP) {
    uint32_t output;
    gethostbyname("localhost", 9, &output);
  }
  return _cc3000_status.hasDHCP;
}

BOOL cc3000_getIPAddress(uint32_t* retip, uint32_t* netmask, uint32_t* gateway, uint32_t* dhcpserv, uint32_t* dnsserv) {
  if (!_cc3000_status.isConnected) {
    return FALSE;
  }
  if (!_cc3000_status.hasDHCP) {
    return FALSE;
  }

  tNetappIpconfigRetArgs ipconfig;
  netapp_ipconfig(&ipconfig);

