joeferner/stm32-wifi-door-bell/firmware/stm32lib/cc3000.c
  /* If byte 1 is 0 we don't have a valid address */
  if (ipconfig.aucIP[3] == 0) {
    return FALSE;
  }

  memcpy(retip, ipconfig.aucIP, 4);
  memcpy(netmask, ipconfig.aucSubnetMask, 4);
  memcpy(gateway, ipconfig.aucDefaultGateway, 4);
  memcpy(dhcpserv, ipconfig.aucDHCPServer, 4);
  memcpy(dnsserv, ipconfig.aucDNSServer, 4);

  return TRUE;
}

BOOL cc3000_getMacAddress(uint8_t* macAddress) {
  return nvmem_read(NVMEM_MAC_FILEID, 6, 0, macAddress) == CC3000_SUCCESS;
}

char* cc3000_ipToString(uint32_t ip, char* buffer) {
  sprintf(buffer, "%d.%d.%d.%d", (uint8_t)(ip >> 24), (uint8_t)(ip >> 16), (uint8_t)(ip >> 8), (uint8_t)(ip >> 0));
  return buffer;
}

BOOL _cc3000_scanSSIDs(uint32_t time) {
  const unsigned long intervalTime[16] = { 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000 };

  // We can abort a scan with a time of 0
  if (time) {
    printf("Started AP/SSID scan\n");
  }

  // Set  SSID Scan params to includes channels above 11
  if (wlan_ioctl_set_scan_params(time, 20, 100, 5, 0x1FFF, -120, 0, 300, (unsigned long*) &intervalTime) != CC3000_SUCCESS) {
    printf("Failed setting params for SSID scan\n");
    return FALSE;
  }

  return TRUE;
}

BOOL _cc3000_connectOpen(const char* ssid) {
  if (wlan_ioctl_set_connection_policy(0, 0, 0) != CC3000_SUCCESS) {
    printf("Failed to set connection policy\n");
    return FALSE;
  }
  delay_ms(500);
  if (wlan_connect(WLAN_SEC_UNSEC, (char*)ssid, strlen(ssid), 0 , NULL, 0) != CC3000_SUCCESS) {
    printf("SSID connection failed\n");
    return FALSE;
  }
  return TRUE;
}

BOOL _cc3000_connectSecure(const char* ssid, const char* key, int32_t secMode) {
  if ((secMode < 0) || (secMode > 3)) {
    printf("Security mode must be between 0 and 3\n");
    return FALSE;
  }

  if (strlen(ssid) > MAXSSID) {
    printf("SSID length must be < %d", MAXSSID);
    return FALSE;
  }

  if (strlen(key) > MAXLENGTHKEY) {
    printf("Key length must be < %d", MAXLENGTHKEY);
    return FALSE;
  }

  if (wlan_ioctl_set_connection_policy(0, 0, 0) != CC3000_SUCCESS) {
    printf("Failed setting the connection policy\n");
    return FALSE;
  };
  delay_ms(500);
  if (wlan_connect(secMode, (char*)ssid, strlen(ssid), NULL, (unsigned char*)key, strlen(key)) != CC3000_SUCCESS) {
    printf("SSID connection failed\n");
    return FALSE;
  }

  /* Wait for 'HCI_EVNT_WLAN_UNSOL_CONNECT' in CC3000_UsynchCallback */
  return TRUE;
}

void _cc3000_asyncCallback(long lEventType, char* data, unsigned char length) {
  if (lEventType == HCI_EVNT_WLAN_ASYNC_SIMPLE_CONFIG_DONE) {
    _cc3000_status.isSmartConfigFinished = TRUE;
  } else if (lEventType == HCI_EVNT_WLAN_UNSOL_CONNECT) {
    _cc3000_status.isConnected = TRUE;
  } else if (lEventType == HCI_EVNT_WLAN_UNSOL_DISCONNECT) {
    _cc3000_status.isConnected = FALSE;
    _cc3000_status.hasDHCP = FALSE;
  } else if (lEventType == HCI_EVNT_WLAN_UNSOL_DHCP) {
    _cc3000_status.hasDHCP = TRUE;
  } else if (lEventType == HCI_EVENT_CC3000_CAN_SHUT_DOWN) {
    _cc3000_status.okToShutdown = TRUE;
  } else if (lEventType == HCI_EVNT_WLAN_ASYNC_PING_REPORT) {
    _cc3000_pingReportNum++;
    memcpy(&_cc3000_pingReport, data, length);
  } else if (lEventType == HCI_EVNT_BSD_TCP_CLOSE_WAIT) {
    uint8_t socketnum;
    socketnum = data[0];
    if (socketnum < MAX_SOCKETS) {
      _cc3000_sockets[socketnum].closed = TRUE;
    }
  }
}

char* _cc3000_sendFWPatches(unsigned long* length) {
  *length = 0;
  return NULL;
}

char* _cc3000_sendDriverPatches(unsigned long* length) {
  *length = 0;
  return NULL;
}

char* _cc3000_sendBootLoaderPatches(unsigned long* length) {
  *length = 0;
  return NULL;
}

long _cc3000_readWlanInterruptPin() {
  return GPIO_ReadInputDataBit(CC3000_IRQ, CC3000_IRQ_PIN) == Bit_SET;
}

void _cc3000_wlanInterruptEnable() {
  EXTI_InitTypeDef extiInitStructure;
  NVIC_InitTypeDef nvicInitStructure;

  GPIO_EXTILineConfig(CC3000_IRQ_EXTI_PORT, CC3000_IRQ_EXTI_PIN);

  EXTI_StructInit(&extiInitStructure);
  extiInitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  extiInitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  extiInitStructure.EXTI_LineCmd = ENABLE;
  extiInitStructure.EXTI_Line = CC3000_IRQ_EXTI_LINE;
  EXTI_Init(&extiInitStructure);

  nvicInitStructure.NVIC_IRQChannel = CC3000_IRQ_EXTI_CH;
  nvicInitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  nvicInitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  nvicInitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&nvicInitStructure);

  _cc3000_irqEnabled = TRUE;
}

void _cc3000_wlanInterruptDisable() {
  EXTI_InitTypeDef extiInitStructure;

  EXTI_StructInit(&extiInitStructure);
  extiInitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  extiInitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  extiInitStructure.EXTI_LineCmd = DISABLE;
  extiInitStructure.EXTI_Line = CC3000_IRQ_EXTI_LINE;
  EXTI_Init(&extiInitStructure);

  _cc3000_irqEnabled = FALSE;
}

void _cc3000_writeWlanPin(unsigned char val) {
  if (val) {
    GPIO_SetBits(CC3000_EN, CC3000_EN_PIN);
  } else {
    GPIO_ResetBits(CC3000_EN, CC3000_EN_PIN);
  }
}

uint8_t _cc3000_spiTransfer(uint8_t d) {
  return spi_transfer(CC3000_SPI, d);
}

void _cc3000_spiReadHeader() {
  _cc3000_spiReadDataSynchronous(_cc3000_spiInformation.rxPacket, CC3000_HEADERS_SIZE_EVNT);
}

void _cc3000_spiReadDataSynchronous(uint8_t* data, uint16_t size) {
  unsigned short i = 0;

  for (i = 0; i < size; i ++) {
    data[i] = _cc3000_spiTransfer(0x03);
  }
}

void _cc3000_ssiContReadOperation() {
  /* The header was read - continue with  the payload read */
  if (_cc3000_spiReadDataCont()) {
    /* All the data was read - finalize handling by switching to teh task
     *  and calling from task Event Handler */
    _cc3000_spiTriggerRxProcessing();
  }
}

void _cc3000_spiTriggerRxProcessing() {
  /* Trigger Rx processing */
  _cc3000_wlanInterruptDisable();
  _cc3000_cs_deassert();

  /* The magic number that resides at the end of the TX/RX buffer (1 byte after the allocated size)
   * for the purpose of detection of the overrun. If the magic number is overriten - buffer overrun
   * occurred - and we will stuck here forever! */
  if (_cc3000_spiInformation.rxPacket[CC3000_RX_BUFFER_SIZE - 1] != CC3000_BUFFER_MAGIC_NUMBER) {
    /* You've got problems if you're here! */
    printf("CC3000: ERROR - magic number missing!\n");
    while (1);
  }

  _cc3000_spiInformation.spiState = CC3000_SPI_STATE_IDLE;
  _cc3000_spiInformation.spiRxHandler(_cc3000_spiInformation.rxPacket + SPI_HEADER_SIZE);
}

BOOL _cc3000_spiReadDataCont() {
  long data_to_recv;
  uint8_t* evnt_buff, type;

  /* Determine what type of packet we have */
  evnt_buff = _cc3000_spiInformation.rxPacket;
  data_to_recv = 0;
  STREAM_TO_UINT8((uint8_t*)(evnt_buff + SPI_HEADER_SIZE), HCI_PACKET_TYPE_OFFSET, type);

  switch (type) {
    case HCI_TYPE_DATA: {
      /* We need to read the rest of data.. */
      STREAM_TO_UINT16((char*)(evnt_buff + SPI_HEADER_SIZE), HCI_DATA_LENGTH_OFFSET, data_to_recv);
      if (!((CC3000_HEADERS_SIZE_EVNT + data_to_recv) & 1)) {
        data_to_recv++;
      }

      if (data_to_recv) {
        _cc3000_spiReadDataSynchronous(evnt_buff + CC3000_HEADERS_SIZE_EVNT, data_to_recv);
      }
      break;
    }
    case HCI_TYPE_EVNT: {
      /* Calculate the rest length of the data */
      STREAM_TO_UINT8((char*)(evnt_buff + SPI_HEADER_SIZE), HCI_EVENT_LENGTH_OFFSET, data_to_recv);
      data_to_recv -= 1;

